rottenpotatoes/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings

    # Remember the checked rantis
    if  params[:ratings].present?
        @checked_rating = params[:ratings].keys
        session[:ratings] = params[:ratings]
    else
      if session[:ratings].present?
         @checked_rating = session[:ratings].keys
      else
        @checked_rating = @all_ratings
      end
    end


    # Remembers if it was sorted or not
    if params[:sort].present?
      session[:sort] = params[:sort]

      if params[:sort]  == "title"
        @movies = Movie.where(rating: @checked_rating).sort_by(&:title)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (SELECT "movies"."id" FROM "movies" ORDER BY release_date) ORDER BY release_date

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # Look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]